{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "filters": 32, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}]}